@edwardmedia please find them below.

[terraform.log](https://github.com/terraform-providers/terraform-provider-google/files/4264627/terraform.log)


```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_access_context_manager_service_perimeter_resource.service-perimeter-resource will be created
  + resource "google_access_context_manager_service_perimeter_resource" "service-perimeter-resource" {
      + id             = (known after apply)
      + perimeter_name = "accessPolicies/650557139361/servicePerimeters/perimeter_1"
      + resource       = (known after apply)
    }

  # google_project.my_project will be created
  + resource "google_project" "my_project" {
      + auto_create_network = true
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "My Project"
      + number              = (known after apply)
      + org_id              = "620189913244"
      + project_id          = "project-452433"
      + skip_delete         = (known after apply)
    }

  # google_project_iam_member.project will be created
  + resource "google_project_iam_member" "project" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:h@domain.com"
      + project = "project-452433"
      + role    = "roles/editor"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```